[Killed] ConditionalExpression
src/index.ts:30:7
  * @returns Razão entre dias treinados e jurados (0..1)
  */
 export function calcularProgressao(ciclo: Ciclo): number {
-  if (ciclo.diasJurados === 0) return 0;
+  if (false) return 0;
   return ciclo.diasTreinados / ciclo.diasJurados;
 }
killedBy: calcularProgressao RN-001: retorna zero quando não há dias jurados
statusReason: expected NaN to be +0 // Object.is equality

[Killed] BlockStatement
src/index.ts:39:56
  * @param ciclo Ciclo a avaliar
  * @returns True se ciclo foi cumprido (dias_treinados >= dias_jurados)
  */
-export function isCicloCumprido(ciclo: Ciclo): boolean {
-  // Trégua e Trégua Recuperação não contam como cumprido (RN-038)
-  if (ciclo.tregua || ciclo.treguaRecuperacao) return false;
-
-  return ciclo.diasTreinados >= ciclo.diasJurados;
-}
+export function isCicloCumprido(ciclo: Ciclo): boolean {}
 
 /**
killedBy: isCicloCumprido RN-002: considera cumprido o ciclo no limite do juramento
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/index.ts:41:55
  */
 export function isCicloCumprido(ciclo: Ciclo): boolean {
   // Trégua e Trégua Recuperação não contam como cumprido (RN-038)
-  if (ciclo.tregua || ciclo.treguaRecuperacao) return false;
+  if (ciclo.tregua || ciclo.treguaRecuperacao) return true;
 
   return ciclo.diasTreinados >= ciclo.diasJurados;
killedBy: isCicloCumprido RN-038: Trégua não classifica ciclo como cumprido
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/index.ts:43:10
   // Trégua e Trégua Recuperação não contam como cumprido (RN-038)
   if (ciclo.tregua || ciclo.treguaRecuperacao) return false;
 
-  return ciclo.diasTreinados >= ciclo.diasJurados;
+  return true;
 }
 
killedBy: progressão de ciclo RN-001/RN-002: fronteira 0/5 classifica progresso 0 como cumprido=false
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/index.ts:43:10
   // Trégua e Trégua Recuperação não contam como cumprido (RN-038)
   if (ciclo.tregua || ciclo.treguaRecuperacao) return false;
 
-  return ciclo.diasTreinados >= ciclo.diasJurados;
+  return ciclo.diasTreinados > ciclo.diasJurados;
 }
 
killedBy: isCicloCumprido RN-002: considera cumprido o ciclo no limite do juramento
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/index.ts:57:7
  */
 export function calcularFolego(ciclo: Ciclo): number {
   // Ciclo não cumprido, Trégua ou Recuperação não gera Fôlego (RN-006, RF-080)
-  if (!isCicloCumprido(ciclo) || ciclo.tregua || ciclo.treguaRecuperacao) {
+  if (false || ciclo.treguaRecuperacao) {
     return 0;
   }
killedBy: calcularFolego RF-080: ciclo quebrado não gera Fôlego
statusReason: expected 2 to be +0 // Object.is equality
