[Killed] BlockStatement
src/event-sourcing/reducers.ts:17:56
 
 const ATRIBUTOS_VALIDOS: readonly Atributo[] = ['forca', 'vigor', 'destreza'];
 
-function isAtributo(valor: unknown): valor is Atributo {
-  return typeof valor === 'string' && (ATRIBUTOS_VALIDOS as readonly string[]).includes(valor);
-}
+function isAtributo(valor: unknown): valor is Atributo {}
 
 interface MarcoPendente {
killedBy: calcularFicha RF-042/RF-049: 3 Marcos contabilizados no mesmo atributo somam +1 ponto
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/event-sourcing/reducers.ts:18:10
 const ATRIBUTOS_VALIDOS: readonly Atributo[] = ['forca', 'vigor', 'destreza'];
 
 function isAtributo(valor: unknown): valor is Atributo {
-  return typeof valor === 'string' && (ATRIBUTOS_VALIDOS as readonly string[]).includes(valor);
+  return false;
 }
 
killedBy: calcularFicha RF-042/RF-049: 3 Marcos contabilizados no mesmo atributo somam +1 ponto
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/event-sourcing/reducers.ts:18:10
 const ATRIBUTOS_VALIDOS: readonly Atributo[] = ['forca', 'vigor', 'destreza'];
 
 function isAtributo(valor: unknown): valor is Atributo {
-  return typeof valor === 'string' && (ATRIBUTOS_VALIDOS as readonly string[]).includes(valor);
+  return typeof valor !== 'string' && (ATRIBUTOS_VALIDOS as readonly string[]).includes(valor);
 }
 
killedBy: calcularFicha RF-042/RF-049: 3 Marcos contabilizados no mesmo atributo somam +1 ponto
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/event-sourcing/reducers.ts:33:49
   marcosContabilizadosAcumulados: Record<Atributo, number>;
 }
 
-export function estadoInicial(): EstadoProjecao {
-  return {
-    ficha: {
-      atributos: { forca: 0, vigor: 0, destreza: 0 },
-      vontade: 0,
-      folego: 0,
-      cicloAtual: 1,
-      ciclosCumpridos: 0,
-      juramento: null,
-      cooldownMarcos: {},
-    },
-    cicloEmAndamento: cicloVazio(1, null),
-    marcosPendentesCiclo: [],
-    marcosContabilizadosAcumulados: { forca: 0, vigor: 0, destreza: 0 },
-  };
-}
+export function estadoInicial(): EstadoProjecao {}
 
 function cicloVazio(numero: number, juramento: Ciclo['juramento'] | null): Ciclo {
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: Cannot read properties of undefined (reading 'cicloEmAndamento')

[Killed] ObjectLiteral
src/event-sourcing/reducers.ts:34:10
 }
 
 export function estadoInicial(): EstadoProjecao {
-  return {
-    ficha: {
-      atributos: { forca: 0, vigor: 0, destreza: 0 },
-      vontade: 0,
-      folego: 0,
-      cicloAtual: 1,
-      ciclosCumpridos: 0,
-      juramento: null,
-      cooldownMarcos: {},
-    },
-    cicloEmAndamento: cicloVazio(1, null),
-    marcosPendentesCiclo: [],
-    marcosContabilizadosAcumulados: { forca: 0, vigor: 0, destreza: 0 },
-  };
+  return {};
 }
 
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: Cannot read properties of undefined (reading 'diasTreinados')

[Survived] ObjectLiteral
src/event-sourcing/reducers.ts:36:18
 export function estadoInicial(): EstadoProjecao {
   return {
     ficha: {
-      atributos: { forca: 0, vigor: 0, destreza: 0 },
+      atributos: {},
       vontade: 0,
       folego: 0,

[Killed] ObjectLiteral
src/event-sourcing/reducers.ts:46:37
     },
     cicloEmAndamento: cicloVazio(1, null),
     marcosPendentesCiclo: [],
-    marcosContabilizadosAcumulados: { forca: 0, vigor: 0, destreza: 0 },
+    marcosContabilizadosAcumulados: {},
   };
 }
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected NaN to be +0 // Object.is equality

[Killed] BlockStatement
src/event-sourcing/reducers.ts:50:82
   };
 }
 
-function cicloVazio(numero: number, juramento: Ciclo['juramento'] | null): Ciclo {
-  return {
-    numero,
-    // Ciclo sem Juramento declarado ainda não progride (RN-001: 0 dias jurados → progressão 0).
-    juramento: juramento ?? { diasPorSemana: 0, dataInicio: new Date(0), dataFim: new Date(0) },
-    diasTreinados: 0,
-    diasJurados: juramento?.diasPorSemana ?? 0,
-    // Placeholder: nunca lido pelo projector — a fonte de verdade de
-    // conclusão é sempre isCicloCumprido(ciclo), recalculada sob demanda.
-    cumprido: false,
-    tregua: false,
-    treguaRecuperacao: false,
-    deload: false,
-  };
-}
+function cicloVazio(numero: number, juramento: Ciclo['juramento'] | null): Ciclo {}
 
 export function aplicarEvento(estado: EstadoProjecao, evento: DiaryEvent): EstadoProjecao {
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: Cannot read properties of undefined (reading 'diasTreinados')

[Killed] ObjectLiteral
src/event-sourcing/reducers.ts:51:10
 }
 
 function cicloVazio(numero: number, juramento: Ciclo['juramento'] | null): Ciclo {
-  return {
-    numero,
-    // Ciclo sem Juramento declarado ainda não progride (RN-001: 0 dias jurados → progressão 0).
-    juramento: juramento ?? { diasPorSemana: 0, dataInicio: new Date(0), dataFim: new Date(0) },
-    diasTreinados: 0,
-    diasJurados: juramento?.diasPorSemana ?? 0,
-    // Placeholder: nunca lido pelo projector — a fonte de verdade de
-    // conclusão é sempre isCicloCumprido(ciclo), recalculada sob demanda.
-    cumprido: false,
-    tregua: false,
-    treguaRecuperacao: false,
-    deload: false,
-  };
+  return {};
 }
 
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected +0 to be 2 // Object.is equality

[Killed] LogicalOperator
src/event-sourcing/reducers.ts:54:16
   return {
     numero,
     // Ciclo sem Juramento declarado ainda não progride (RN-001: 0 dias jurados → progressão 0).
-    juramento: juramento ?? { diasPorSemana: 0, dataInicio: new Date(0), dataFim: new Date(0) },
+    juramento: juramento && {
+  diasPorSemana: 0,
+  dataInicio: new Date(0),
+  dataFim: new Date(0)
+},
     diasTreinados: 0,
     diasJurados: juramento?.diasPorSemana ?? 0,
killedBy: calcularFicha RF-042/RF-049: 3 Marcos contabilizados no mesmo atributo somam +1 ponto
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ObjectLiteral
src/event-sourcing/reducers.ts:54:29
   return {
     numero,
     // Ciclo sem Juramento declarado ainda não progride (RN-001: 0 dias jurados → progressão 0).
-    juramento: juramento ?? { diasPorSemana: 0, dataInicio: new Date(0), dataFim: new Date(0) },
+    juramento: juramento ?? {},
     diasTreinados: 0,
     diasJurados: juramento?.diasPorSemana ?? 0,

[Killed] OptionalChaining
src/event-sourcing/reducers.ts:56:18
     // Ciclo sem Juramento declarado ainda não progride (RN-001: 0 dias jurados → progressão 0).
     juramento: juramento ?? { diasPorSemana: 0, dataInicio: new Date(0), dataFim: new Date(0) },
     diasTreinados: 0,
-    diasJurados: juramento?.diasPorSemana ?? 0,
+    diasJurados: juramento.diasPorSemana ?? 0,
     // Placeholder: nunca lido pelo projector — a fonte de verdade de
     // conclusão é sempre isCicloCumprido(ciclo), recalculada sob demanda.
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: Cannot read properties of null (reading 'diasPorSemana')

[Killed] LogicalOperator
src/event-sourcing/reducers.ts:56:18
     // Ciclo sem Juramento declarado ainda não progride (RN-001: 0 dias jurados → progressão 0).
     juramento: juramento ?? { diasPorSemana: 0, dataInicio: new Date(0), dataFim: new Date(0) },
     diasTreinados: 0,
-    diasJurados: juramento?.diasPorSemana ?? 0,
+    diasJurados: juramento?.diasPorSemana && 0,
     // Placeholder: nunca lido pelo projector — a fonte de verdade de
     // conclusão é sempre isCicloCumprido(ciclo), recalculada sob demanda.
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected 1 to be 2 // Object.is equality

[Survived] BooleanLiteral
src/event-sourcing/reducers.ts:59:15
     diasJurados: juramento?.diasPorSemana ?? 0,
     // Placeholder: nunca lido pelo projector — a fonte de verdade de
     // conclusão é sempre isCicloCumprido(ciclo), recalculada sob demanda.
-    cumprido: false,
+    cumprido: true,
     tregua: false,
     treguaRecuperacao: false,

[Killed] BooleanLiteral
src/event-sourcing/reducers.ts:60:13
     // Placeholder: nunca lido pelo projector — a fonte de verdade de
     // conclusão é sempre isCicloCumprido(ciclo), recalculada sob demanda.
     cumprido: false,
-    tregua: false,
+    tregua: true,
     treguaRecuperacao: false,
     deload: false,
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/event-sourcing/reducers.ts:61:24
     // conclusão é sempre isCicloCumprido(ciclo), recalculada sob demanda.
     cumprido: false,
     tregua: false,
-    treguaRecuperacao: false,
+    treguaRecuperacao: true,
     deload: false,
   };
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected +0 to be 2 // Object.is equality

[Survived] BooleanLiteral
src/event-sourcing/reducers.ts:62:13
     cumprido: false,
     tregua: false,
     treguaRecuperacao: false,
-    deload: false,
+    deload: true,
   };
 }

[Killed] BlockStatement
src/event-sourcing/reducers.ts:66:91
   };
 }
 
-export function aplicarEvento(estado: EstadoProjecao, evento: DiaryEvent): EstadoProjecao {
-  switch (evento.tipo) {
-    case 'juramento_declarado':
-      return reduzJuramentoDeclarado(estado, evento);
-    case 'sessao_registrada':
-      return reduzSessaoRegistrada(estado);
-    case 'tregua_declarada':
-      return reduzFlagCiclo(estado, 'tregua');
-    case 'tregua_recuperacao_declarada':
-      return reduzFlagCiclo(estado, 'treguaRecuperacao');
-    case 'deload_declarado':
-      return reduzFlagCiclo(estado, 'deload');
-    case 'marco_declarado':
-      return reduzMarcoDeclarado(estado, evento);
-    case 'ciclo_encerrado':
-      return reduzCicloEncerrado(estado);
-    default:
-      return estado;
-  }
-}
+export function aplicarEvento(estado: EstadoProjecao, evento: DiaryEvent): EstadoProjecao {}
 
 function reduzJuramentoDeclarado(estado: EstadoProjecao, evento: DiaryEvent): EstadoProjecao {
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: Cannot read properties of undefined (reading 'ficha')

[Killed] ConditionalExpression
src/event-sourcing/reducers.ts:68:5
 
 export function aplicarEvento(estado: EstadoProjecao, evento: DiaryEvent): EstadoProjecao {
   switch (evento.tipo) {
-    case 'juramento_declarado':
-      return reduzJuramentoDeclarado(estado, evento);
+    case 'juramento_declarado':
     case 'sessao_registrada':
       return reduzSessaoRegistrada(estado);
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/event-sourcing/reducers.ts:70:5
   switch (evento.tipo) {
     case 'juramento_declarado':
       return reduzJuramentoDeclarado(estado, evento);
-    case 'sessao_registrada':
-      return reduzSessaoRegistrada(estado);
+    case 'sessao_registrada':
     case 'tregua_declarada':
       return reduzFlagCiclo(estado, 'tregua');
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected +0 to be 2 // Object.is equality

[Survived] ConditionalExpression
src/event-sourcing/reducers.ts:72:5
       return reduzJuramentoDeclarado(estado, evento);
     case 'sessao_registrada':
       return reduzSessaoRegistrada(estado);
-    case 'tregua_declarada':
-      return reduzFlagCiclo(estado, 'tregua');
+    case 'tregua_declarada':
     case 'tregua_recuperacao_declarada':
       return reduzFlagCiclo(estado, 'treguaRecuperacao');

[Survived] ConditionalExpression
src/event-sourcing/reducers.ts:74:5
       return reduzSessaoRegistrada(estado);
     case 'tregua_declarada':
       return reduzFlagCiclo(estado, 'tregua');
-    case 'tregua_recuperacao_declarada':
-      return reduzFlagCiclo(estado, 'treguaRecuperacao');
+    case 'tregua_recuperacao_declarada':
     case 'deload_declarado':
       return reduzFlagCiclo(estado, 'deload');

[Killed] ConditionalExpression
src/event-sourcing/reducers.ts:76:5
       return reduzFlagCiclo(estado, 'tregua');
     case 'tregua_recuperacao_declarada':
       return reduzFlagCiclo(estado, 'treguaRecuperacao');
-    case 'deload_declarado':
-      return reduzFlagCiclo(estado, 'deload');
+    case 'deload_declarado':
     case 'marco_declarado':
       return reduzMarcoDeclarado(estado, evento);
killedBy: calcularFicha RF-082: deload declarado no ciclo dobra o teto de Fôlego ganho
statusReason: expected 2 to be 4 // Object.is equality

[Killed] StringLiteral
src/event-sourcing/reducers.ts:77:37
     case 'tregua_recuperacao_declarada':
       return reduzFlagCiclo(estado, 'treguaRecuperacao');
     case 'deload_declarado':
-      return reduzFlagCiclo(estado, 'deload');
+      return reduzFlagCiclo(estado, "");
     case 'marco_declarado':
       return reduzMarcoDeclarado(estado, evento);
killedBy: calcularFicha RF-082: deload declarado no ciclo dobra o teto de Fôlego ganho
statusReason: expected 2 to be 4 // Object.is equality

[Killed] ConditionalExpression
src/event-sourcing/reducers.ts:78:5
       return reduzFlagCiclo(estado, 'treguaRecuperacao');
     case 'deload_declarado':
       return reduzFlagCiclo(estado, 'deload');
-    case 'marco_declarado':
-      return reduzMarcoDeclarado(estado, evento);
+    case 'marco_declarado':
     case 'ciclo_encerrado':
       return reduzCicloEncerrado(estado);
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected 5 to be 3 // Object.is equality

[Killed] StringLiteral
src/event-sourcing/reducers.ts:78:10
       return reduzFlagCiclo(estado, 'treguaRecuperacao');
     case 'deload_declarado':
       return reduzFlagCiclo(estado, 'deload');
-    case 'marco_declarado':
+    case "":
       return reduzMarcoDeclarado(estado, evento);
     case 'ciclo_encerrado':
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected undefined to be 4 // Object.is equality

[Killed] ConditionalExpression
src/event-sourcing/reducers.ts:80:5
       return reduzFlagCiclo(estado, 'deload');
     case 'marco_declarado':
       return reduzMarcoDeclarado(estado, evento);
-    case 'ciclo_encerrado':
-      return reduzCicloEncerrado(estado);
+    case 'ciclo_encerrado':
     default:
       return estado;
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected 1 to be 3 // Object.is equality

[NoCoverage] ConditionalExpression
src/event-sourcing/reducers.ts:82:5
       return reduzMarcoDeclarado(estado, evento);
     case 'ciclo_encerrado':
       return reduzCicloEncerrado(estado);
-    default:
-      return estado;
+    default:
   }
 }

[Killed] BlockStatement
src/event-sourcing/reducers.ts:87:94
   }
 }
 
-function reduzJuramentoDeclarado(estado: EstadoProjecao, evento: DiaryEvent): EstadoProjecao {
-  // RF-005: troca de Juramento em ciclo já em curso é ignorada pelo replay
-  // (deveria ter sido rejeitada na escrita do evento).
-  if (estado.cicloEmAndamento.diasTreinados > 0) return estado;
-
-  const diasPorSemana = Number(evento.payload.diasPorSemana);
-  // RF-004: evento malformado ou fora de 1-6 dias/semana é ignorado no replay
-  // em vez de propagar NaN/valor inválido para o cálculo de progressão.
-  if (!validarJuramento(diasPorSemana)) return estado;
-
-  const juramento = {
-    diasPorSemana,
-    dataInicio: new Date(evento.ocorridoEm),
-    dataFim: new Date(evento.ocorridoEm),
-  };
-
-  return {
-    ...estado,
-    ficha: { ...estado.ficha, juramento },
-    cicloEmAndamento: { ...estado.cicloEmAndamento, juramento, diasJurados: diasPorSemana },
-  };
-}
+function reduzJuramentoDeclarado(estado: EstadoProjecao, evento: DiaryEvent): EstadoProjecao {}
 
 function reduzSessaoRegistrada(estado: EstadoProjecao): EstadoProjecao {
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: Cannot read properties of undefined (reading 'cicloEmAndamento')

[Killed] EqualityOperator
src/event-sourcing/reducers.ts:90:7
 function reduzJuramentoDeclarado(estado: EstadoProjecao, evento: DiaryEvent): EstadoProjecao {
   // RF-005: troca de Juramento em ciclo já em curso é ignorada pelo replay
   // (deveria ter sido rejeitada na escrita do evento).
-  if (estado.cicloEmAndamento.diasTreinados > 0) return estado;
+  if (estado.cicloEmAndamento.diasTreinados >= 0) return estado;
 
   const diasPorSemana = Number(evento.payload.diasPorSemana);
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/event-sourcing/reducers.ts:90:7
 function reduzJuramentoDeclarado(estado: EstadoProjecao, evento: DiaryEvent): EstadoProjecao {
   // RF-005: troca de Juramento em ciclo já em curso é ignorada pelo replay
   // (deveria ter sido rejeitada na escrita do evento).
-  if (estado.cicloEmAndamento.diasTreinados > 0) return estado;
+  if (false) return estado;
 
   const diasPorSemana = Number(evento.payload.diasPorSemana);
killedBy: calcularFicha RF-005: troca de Juramento em ciclo já com sessão registrada é ignorada pelo replay
statusReason: expected 6 to be 3 // Object.is equality

[Killed] ConditionalExpression
src/event-sourcing/reducers.ts:95:7
   const diasPorSemana = Number(evento.payload.diasPorSemana);
   // RF-004: evento malformado ou fora de 1-6 dias/semana é ignorado no replay
   // em vez de propagar NaN/valor inválido para o cálculo de progressão.
-  if (!validarJuramento(diasPorSemana)) return estado;
+  if (false) return estado;
 
   const juramento = {
killedBy: calcularFicha RF-004: juramento_declarado com dias fora de 1-6 é ignorado no replay
statusReason: expected { diasPorSemana: 999, …(2) } to be null

[Killed] BooleanLiteral
src/event-sourcing/reducers.ts:95:7
   const diasPorSemana = Number(evento.payload.diasPorSemana);
   // RF-004: evento malformado ou fora de 1-6 dias/semana é ignorado no replay
   // em vez de propagar NaN/valor inválido para o cálculo de progressão.
-  if (!validarJuramento(diasPorSemana)) return estado;
+  if (validarJuramento(diasPorSemana)) return estado;
 
   const juramento = {
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ObjectLiteral
src/event-sourcing/reducers.ts:105:12
 
   return {
     ...estado,
-    ficha: { ...estado.ficha, juramento },
+    ficha: {},
     cicloEmAndamento: { ...estado.cicloEmAndamento, juramento, diasJurados: diasPorSemana },
   };
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: Cannot read properties of undefined (reading 'agachamento')

[Killed] ObjectLiteral
src/event-sourcing/reducers.ts:106:23
   return {
     ...estado,
     ficha: { ...estado.ficha, juramento },
-    cicloEmAndamento: { ...estado.cicloEmAndamento, juramento, diasJurados: diasPorSemana },
+    cicloEmAndamento: {},
   };
 }
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/event-sourcing/reducers.ts:110:72
   };
 }
 
-function reduzSessaoRegistrada(estado: EstadoProjecao): EstadoProjecao {
-  // RF-053: sessão composta por múltiplos blocos ainda conta como 1 dia do Juramento.
-  return {
-    ...estado,
-    cicloEmAndamento: {
-      ...estado.cicloEmAndamento,
-      diasTreinados: estado.cicloEmAndamento.diasTreinados + 1,
-    },
-  };
-}
+function reduzSessaoRegistrada(estado: EstadoProjecao): EstadoProjecao {}
 
 function reduzFlagCiclo(estado: EstadoProjecao, flag: 'tregua' | 'treguaRecuperacao' | 'deload'): EstadoProjecao {
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: Cannot read properties of undefined (reading 'ficha')

[Killed] ObjectLiteral
src/event-sourcing/reducers.ts:112:10
 
 function reduzSessaoRegistrada(estado: EstadoProjecao): EstadoProjecao {
   // RF-053: sessão composta por múltiplos blocos ainda conta como 1 dia do Juramento.
-  return {
-    ...estado,
-    cicloEmAndamento: {
-      ...estado.cicloEmAndamento,
-      diasTreinados: estado.cicloEmAndamento.diasTreinados + 1,
-    },
-  };
+  return {};
 }
 
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: Cannot read properties of undefined (reading 'cicloAtual')

[Killed] ObjectLiteral
src/event-sourcing/reducers.ts:114:23
   // RF-053: sessão composta por múltiplos blocos ainda conta como 1 dia do Juramento.
   return {
     ...estado,
-    cicloEmAndamento: {
-      ...estado.cicloEmAndamento,
-      diasTreinados: estado.cicloEmAndamento.diasTreinados + 1,
-    },
+    cicloEmAndamento: {},
   };
 }
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArithmeticOperator
src/event-sourcing/reducers.ts:116:22
     ...estado,
     cicloEmAndamento: {
       ...estado.cicloEmAndamento,
-      diasTreinados: estado.cicloEmAndamento.diasTreinados + 1,
+      diasTreinados: estado.cicloEmAndamento.diasTreinados - 1,
     },
   };
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/event-sourcing/reducers.ts:121:114
   };
 }
 
-function reduzFlagCiclo(estado: EstadoProjecao, flag: 'tregua' | 'treguaRecuperacao' | 'deload'): EstadoProjecao {
-  return {
-    ...estado,
-    cicloEmAndamento: { ...estado.cicloEmAndamento, [flag]: true },
-  };
-}
+function reduzFlagCiclo(estado: EstadoProjecao, flag: 'tregua' | 'treguaRecuperacao' | 'deload'): EstadoProjecao {}
 
 function reduzMarcoDeclarado(estado: EstadoProjecao, evento: DiaryEvent): EstadoProjecao {
killedBy: calcularFicha RN-038: Trégua declarada no ciclo impede contagem de cumprido e Fôlego
statusReason: Cannot read properties of undefined (reading 'cicloEmAndamento')

[Killed] BooleanLiteral
src/event-sourcing/reducers.ts:124:61
 function reduzFlagCiclo(estado: EstadoProjecao, flag: 'tregua' | 'treguaRecuperacao' | 'deload'): EstadoProjecao {
   return {
     ...estado,
-    cicloEmAndamento: { ...estado.cicloEmAndamento, [flag]: true },
+    cicloEmAndamento: { ...estado.cicloEmAndamento, [flag]: false },
   };
 }
killedBy: calcularFicha RF-082: deload declarado no ciclo dobra o teto de Fôlego ganho
statusReason: expected 2 to be 4 // Object.is equality

[Killed] ObjectLiteral
src/event-sourcing/reducers.ts:124:23
 function reduzFlagCiclo(estado: EstadoProjecao, flag: 'tregua' | 'treguaRecuperacao' | 'deload'): EstadoProjecao {
   return {
     ...estado,
-    cicloEmAndamento: { ...estado.cicloEmAndamento, [flag]: true },
+    cicloEmAndamento: {},
   };
 }
killedBy: calcularFicha RF-082: deload declarado no ciclo dobra o teto de Fôlego ganho
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/event-sourcing/reducers.ts:128:90
   };
 }
 
-function reduzMarcoDeclarado(estado: EstadoProjecao, evento: DiaryEvent): EstadoProjecao {
-  const rotulo = String(evento.payload.rotulo);
-  const atributo = evento.payload.atributo;
-  // Atributo inválido/desconhecido: registra o cooldown do rótulo (DI-008)
-  // mas não entra na lista de pendentes de conversão em pontos.
-  if (!isAtributo(atributo)) {
-    return {
-      ...estado,
-      ficha: { ...estado.ficha, cooldownMarcos: aplicarCooldown(rotulo, estado.ficha.cicloAtual, estado.ficha.cooldownMarcos) },
-    };
-  }
-
-  const elegivel = podeDeclararMarco(rotulo, estado.ficha.cicloAtual, estado.ficha.cooldownMarcos);
-
-  // DI-008: cooldown inicia na declaração, contabilizado ou não (RF-044).
-  const cooldownMarcos = aplicarCooldown(rotulo, estado.ficha.cicloAtual, estado.ficha.cooldownMarcos);
-
-  return {
-    ...estado,
-    ficha: { ...estado.ficha, cooldownMarcos },
-    marcosPendentesCiclo: [...estado.marcosPendentesCiclo, { atributo, elegivel }],
-  };
-}
+function reduzMarcoDeclarado(estado: EstadoProjecao, evento: DiaryEvent): EstadoProjecao {}
 
 function reduzCicloEncerrado(estado: EstadoProjecao): EstadoProjecao {
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: Cannot read properties of undefined (reading 'cicloEmAndamento')

[Killed] ConditionalExpression
src/event-sourcing/reducers.ts:133:7
   const atributo = evento.payload.atributo;
   // Atributo inválido/desconhecido: registra o cooldown do rótulo (DI-008)
   // mas não entra na lista de pendentes de conversão em pontos.
-  if (!isAtributo(atributo)) {
+  if (true) {
     return {
       ...estado,
killedBy: calcularFicha RF-042/RF-049: 3 Marcos contabilizados no mesmo atributo somam +1 ponto
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/event-sourcing/reducers.ts:133:7
   const atributo = evento.payload.atributo;
   // Atributo inválido/desconhecido: registra o cooldown do rótulo (DI-008)
   // mas não entra na lista de pendentes de conversão em pontos.
-  if (!isAtributo(atributo)) {
+  if (isAtributo(atributo)) {
     return {
       ...estado,
killedBy: calcularFicha RF-042/RF-049: 3 Marcos contabilizados no mesmo atributo somam +1 ponto
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/event-sourcing/reducers.ts:156:27
   const ciclo = estado.cicloEmAndamento;
   const cumprido = isCicloCumprido(ciclo);
   const folegoGanho = calcularFolego(ciclo);
-  const ciclosCumpridos = estado.ficha.ciclosCumpridos + (cumprido ? 1 : 0);
+  const ciclosCumpridos = estado.ficha.ciclosCumpridos - (cumprido ? 1 : 0);
 
   // RF-044: Marco só é contabilizado em ciclo cumprido; excedente acima do
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected -2 to be 2 // Object.is equality

[Killed] ArrowFunction
src/event-sourcing/reducers.ts:160:63
 
   // RF-044: Marco só é contabilizado em ciclo cumprido; excedente acima do
   // teto (RF-042) e Marcos bloqueados por cooldown ficam registrados, não contabilizados.
-  const elegiveisNaOrdem = estado.marcosPendentesCiclo.filter((m) => m.elegivel);
+  const elegiveisNaOrdem = estado.marcosPendentesCiclo.filter(() => undefined);
   const quantosContabilizar = cumprido ? limitarMarcosContabilizados(elegiveisNaOrdem.length) : 0;
   const contabilizados = elegiveisNaOrdem.slice(0, quantosContabilizar);
killedBy: calcularFicha RF-042/RF-049: 3 Marcos contabilizados no mesmo atributo somam +1 ponto
statusReason: expected +0 to be 1 // Object.is equality

[Survived] MethodExpression
src/event-sourcing/reducers.ts:160:28
 
   // RF-044: Marco só é contabilizado em ciclo cumprido; excedente acima do
   // teto (RF-042) e Marcos bloqueados por cooldown ficam registrados, não contabilizados.
-  const elegiveisNaOrdem = estado.marcosPendentesCiclo.filter((m) => m.elegivel);
+  const elegiveisNaOrdem = estado.marcosPendentesCiclo;
   const quantosContabilizar = cumprido ? limitarMarcosContabilizados(elegiveisNaOrdem.length) : 0;
   const contabilizados = elegiveisNaOrdem.slice(0, quantosContabilizar);

[Survived] MethodExpression
src/event-sourcing/reducers.ts:162:26
   // teto (RF-042) e Marcos bloqueados por cooldown ficam registrados, não contabilizados.
   const elegiveisNaOrdem = estado.marcosPendentesCiclo.filter((m) => m.elegivel);
   const quantosContabilizar = cumprido ? limitarMarcosContabilizados(elegiveisNaOrdem.length) : 0;
-  const contabilizados = elegiveisNaOrdem.slice(0, quantosContabilizar);
+  const contabilizados = elegiveisNaOrdem;
 
   const marcosContabilizadosAcumulados = { ...estado.marcosContabilizadosAcumulados };

[Killed] BlockStatement
src/event-sourcing/reducers.ts:165:39
   const contabilizados = elegiveisNaOrdem.slice(0, quantosContabilizar);
 
   const marcosContabilizadosAcumulados = { ...estado.marcosContabilizadosAcumulados };
-  for (const marco of contabilizados) {
-    marcosContabilizadosAcumulados[marco.atributo] += 1;
-  }
+  for (const marco of contabilizados) {}
 
   // Base sempre 0: calcularPontosAtributo recomputa o bônus inteiro a partir
killedBy: calcularFicha RF-042/RF-049: 3 Marcos contabilizados no mesmo atributo somam +1 ponto
statusReason: expected +0 to be 1 // Object.is equality

[Killed] AssignmentOperator
src/event-sourcing/reducers.ts:166:5
 
   const marcosContabilizadosAcumulados = { ...estado.marcosContabilizadosAcumulados };
   for (const marco of contabilizados) {
-    marcosContabilizadosAcumulados[marco.atributo] += 1;
+    marcosContabilizadosAcumulados[marco.atributo] -= 1;
   }
 
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected -1 to be +0 // Object.is equality
