[Killed] ObjectLiteral
src/event-sourcing/reducers.ts:173:21
   // do total acumulado a cada fechamento (idempotente), não incrementa sobre
   // o valor anterior — não há um "atributo base" além dos Marcos rastreado
   // nesta fase. Se isso mudar, esta chamada precisa passar a base real.
-  const atributos = {
-    forca: calcularPontosAtributo(marcosContabilizadosAcumulados.forca, 0),
-    vigor: calcularPontosAtributo(marcosContabilizadosAcumulados.vigor, 0),
-    destreza: calcularPontosAtributo(marcosContabilizadosAcumulados.destreza, 0),
-  };
+  const atributos = {};
 
   const proximoCicloAtual = estado.ficha.cicloAtual + 1;
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/event-sourcing/reducers.ts:179:29
     destreza: calcularPontosAtributo(marcosContabilizadosAcumulados.destreza, 0),
   };
 
-  const proximoCicloAtual = estado.ficha.cicloAtual + 1;
+  const proximoCicloAtual = estado.ficha.cicloAtual - 1;
 
   return {
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected -1 to be 3 // Object.is equality

[Killed] MethodExpression
src/event-sourcing/reducers.ts:186:15
       ...estado.ficha,
       atributos,
       vontade: calcularVontade(ciclosCumpridos),
-      folego: Math.min(estado.ficha.folego + folegoGanho, 4),
+      folego: Math.max(estado.ficha.folego + folegoGanho, 4),
       cicloAtual: proximoCicloAtual,
       ciclosCumpridos,
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected 6 to be 4 // Object.is equality

[Killed] ArithmeticOperator
src/event-sourcing/reducers.ts:186:24
       ...estado.ficha,
       atributos,
       vontade: calcularVontade(ciclosCumpridos),
-      folego: Math.min(estado.ficha.folego + folegoGanho, 4),
+      folego: Math.min(estado.ficha.folego - folegoGanho, 4),
       cicloAtual: proximoCicloAtual,
       ciclosCumpridos,
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected -4 to be 4 // Object.is equality
