[Killed] BlockStatement
src/ciclo.ts:23:58
  * @param ciclo Ciclo a avaliar
  * @returns Razão entre dias treinados e jurados (0..1)
  */
-export function calcularProgressao(ciclo: Ciclo): number {
-  if (ciclo.diasJurados === 0) return 0;
-  return ciclo.diasTreinados / ciclo.diasJurados;
-}
+export function calcularProgressao(ciclo: Ciclo): number {}
 
 /**
killedBy: calcularProgressao RN-001: calcula a razão entre dias treinados e jurados
statusReason: expected undefined to be close to 0.667, received difference is NaN, but expected 0.005

[Killed] EqualityOperator
src/ciclo.ts:24:7
  * @returns Razão entre dias treinados e jurados (0..1)
  */
 export function calcularProgressao(ciclo: Ciclo): number {
-  if (ciclo.diasJurados === 0) return 0;
+  if (ciclo.diasJurados !== 0) return 0;
   return ciclo.diasTreinados / ciclo.diasJurados;
 }
killedBy: calcularProgressao RN-001: calcula a razão entre dias treinados e jurados
statusReason: expected +0 to be close to 0.667, received difference is 0.667, but expected 0.005

[Killed] ConditionalExpression
src/ciclo.ts:24:7
  * @returns Razão entre dias treinados e jurados (0..1)
  */
 export function calcularProgressao(ciclo: Ciclo): number {
-  if (ciclo.diasJurados === 0) return 0;
+  if (true) return 0;
   return ciclo.diasTreinados / ciclo.diasJurados;
 }
killedBy: calcularProgressao RN-001: calcula a razão entre dias treinados e jurados
statusReason: expected +0 to be close to 0.667, received difference is 0.667, but expected 0.005

[Killed] ArithmeticOperator
src/ciclo.ts:25:10
  */
 export function calcularProgressao(ciclo: Ciclo): number {
   if (ciclo.diasJurados === 0) return 0;
-  return ciclo.diasTreinados / ciclo.diasJurados;
+  return ciclo.diasTreinados * ciclo.diasJurados;
 }
 
killedBy: calcularProgressao RN-001: calcula a razão entre dias treinados e jurados
statusReason: expected 6 to be close to 0.667, received difference is 5.333, but expected 0.005

[Killed] BlockStatement
src/ciclo.ts:33:56
  * @param ciclo Ciclo a avaliar
  * @returns True se ciclo foi cumprido (dias_treinados >= dias_jurados)
  */
-export function isCicloCumprido(ciclo: Ciclo): boolean {
-  // Trégua e Trégua Recuperação não contam como cumprido (RN-038)
-  if (ciclo.tregua || ciclo.treguaRecuperacao) return false;
-
-  // Sem Juramento declarado não há o que cumprir (RN-001: progressão é função
-  // exclusiva de treinados/jurados — 0/0 não é avanço, é ausência de dado).
-  if (ciclo.diasJurados === 0) return false;
-
-  return ciclo.diasTreinados >= ciclo.diasJurados;
-}
+export function isCicloCumprido(ciclo: Ciclo): boolean {}
 
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected +0 to be 2 // Object.is equality

[Killed] LogicalOperator
src/ciclo.ts:35:7
  */
 export function isCicloCumprido(ciclo: Ciclo): boolean {
   // Trégua e Trégua Recuperação não contam como cumprido (RN-038)
-  if (ciclo.tregua || ciclo.treguaRecuperacao) return false;
+  if (ciclo.tregua && ciclo.treguaRecuperacao) return false;
 
   // Sem Juramento declarado não há o que cumprir (RN-001: progressão é função
killedBy: isCicloCumprido RN-038: Trégua não classifica ciclo como cumprido
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/ciclo.ts:35:7
  */
 export function isCicloCumprido(ciclo: Ciclo): boolean {
   // Trégua e Trégua Recuperação não contam como cumprido (RN-038)
-  if (ciclo.tregua || ciclo.treguaRecuperacao) return false;
+  if (true) return false;
 
   // Sem Juramento declarado não há o que cumprir (RN-001: progressão é função
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
src/ciclo.ts:39:7
 
   // Sem Juramento declarado não há o que cumprir (RN-001: progressão é função
   // exclusiva de treinados/jurados — 0/0 não é avanço, é ausência de dado).
-  if (ciclo.diasJurados === 0) return false;
+  if (ciclo.diasJurados !== 0) return false;
 
   return ciclo.diasTreinados >= ciclo.diasJurados;
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/ciclo.ts:39:7
 
   // Sem Juramento declarado não há o que cumprir (RN-001: progressão é função
   // exclusiva de treinados/jurados — 0/0 não é avanço, é ausência de dado).
-  if (ciclo.diasJurados === 0) return false;
+  if (true) return false;
 
   return ciclo.diasTreinados >= ciclo.diasJurados;
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
src/ciclo.ts:41:10
   // exclusiva de treinados/jurados — 0/0 não é avanço, é ausência de dado).
   if (ciclo.diasJurados === 0) return false;
 
-  return ciclo.diasTreinados >= ciclo.diasJurados;
+  return ciclo.diasTreinados < ciclo.diasJurados;
 }
 
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/ciclo.ts:41:10
   // exclusiva de treinados/jurados — 0/0 não é avanço, é ausência de dado).
   if (ciclo.diasJurados === 0) return false;
 
-  return ciclo.diasTreinados >= ciclo.diasJurados;
+  return false;
 }
 
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected +0 to be 2 // Object.is equality
