[Killed] BlockStatement
src/event-sourcing/projector.ts:18:61
  * @param eventos Log de `diary_events` do usuário, em ordem cronológica
  * @returns Ficha projetada
  */
-export function calcularFicha(eventos: DiaryEvent[]): Ficha {
-  let estado = estadoInicial();
-
-  for (const evento of eventos) {
-    estado = aplicarEvento(estado, evento);
-  }
-
-  return estado.ficha;
-}
+export function calcularFicha(eventos: DiaryEvent[]): Ficha {}
 
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: Cannot read properties of undefined (reading 'cicloAtual')

[Killed] BlockStatement
src/event-sourcing/projector.ts:21:33
 export function calcularFicha(eventos: DiaryEvent[]): Ficha {
   let estado = estadoInicial();
 
-  for (const evento of eventos) {
-    estado = aplicarEvento(estado, evento);
-  }
+  for (const evento of eventos) {}
 
   return estado.ficha;
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected 1 to be 3 // Object.is equality
