[Killed] BlockStatement
src/folego.ts:17:54
  * @param ciclo Ciclo encerrado
  * @returns Fôlego gerado (0, 1 ou 2; até 4 em deload)
  */
-export function calcularFolego(ciclo: Ciclo): number {
-  // Ciclo não cumprido, Trégua ou Recuperação não gera Fôlego (RN-006, RF-080)
-  if (!isCicloCumprido(ciclo) || ciclo.tregua || ciclo.treguaRecuperacao) {
-    return 0;
-  }
-
-  // Dias sem treino no ciclo (semana = 7 dias)
-  const diasDescanso = 7 - ciclo.diasTreinados;
-
-  // Deload dobra o teto (D-044, RF-082)
-  const teto = ciclo.deload ? 4 : 2;
-
-  // Mínimo entre dias descanso e teto
-  return Math.min(diasDescanso, teto);
-}
+export function calcularFolego(ciclo: Ciclo): number {}
 
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected NaN to be 4 // Object.is equality

[Killed] LogicalOperator
src/folego.ts:19:7
  */
 export function calcularFolego(ciclo: Ciclo): number {
   // Ciclo não cumprido, Trégua ou Recuperação não gera Fôlego (RN-006, RF-080)
-  if (!isCicloCumprido(ciclo) || ciclo.tregua || ciclo.treguaRecuperacao) {
+  if ((!isCicloCumprido(ciclo) || ciclo.tregua) && ciclo.treguaRecuperacao) {
     return 0;
   }
killedBy: calcularFicha RN-038: Trégua declarada no ciclo impede contagem de cumprido e Fôlego
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/folego.ts:19:7
  */
 export function calcularFolego(ciclo: Ciclo): number {
   // Ciclo não cumprido, Trégua ou Recuperação não gera Fôlego (RN-006, RF-080)
-  if (!isCicloCumprido(ciclo) || ciclo.tregua || ciclo.treguaRecuperacao) {
+  if (true) {
     return 0;
   }
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected +0 to be 4 // Object.is equality

[Killed] ArithmeticOperator
src/folego.ts:24:24
   }
 
   // Dias sem treino no ciclo (semana = 7 dias)
-  const diasDescanso = 7 - ciclo.diasTreinados;
+  const diasDescanso = 7 + ciclo.diasTreinados;
 
   // Deload dobra o teto (D-044, RF-082)
killedBy: calcularFolego RF-080/RF-084: juramento 6, treino 6 gera 1 Fôlego
statusReason: expected 2 to be 1 // Object.is equality

[Killed] MethodExpression
src/folego.ts:30:10
   const teto = ciclo.deload ? 4 : 2;
 
   // Mínimo entre dias descanso e teto
-  return Math.min(diasDescanso, teto);
+  return Math.max(diasDescanso, teto);
 }
 
killedBy: Juramento RF-082: deload dobra teto de Fôlego do Juramento
statusReason: expected 5 to be 4 // Object.is equality
