[Killed] BlockStatement
src/juramento.ts:17:66
  * @param diasPorSemana Valor declarado pelo usuário
  * @returns True se dentro do intervalo aceito
  */
-export function validarJuramento(diasPorSemana: number): boolean {
-  return Number.isInteger(diasPorSemana) && diasPorSemana >= 1 && diasPorSemana <= 6;
-}
+export function validarJuramento(diasPorSemana: number): boolean {}
 
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/juramento.ts:18:10
  * @returns True se dentro do intervalo aceito
  */
 export function validarJuramento(diasPorSemana: number): boolean {
-  return Number.isInteger(diasPorSemana) && diasPorSemana >= 1 && diasPorSemana <= 6;
+  return true;
 }
 
killedBy: calcularFicha RF-004: juramento_declarado com dias fora de 1-6 é ignorado no replay
statusReason: expected { diasPorSemana: 999, …(2) } to be null

[Killed] ConditionalExpression
src/juramento.ts:18:10
  * @returns True se dentro do intervalo aceito
  */
 export function validarJuramento(diasPorSemana: number): boolean {
-  return Number.isInteger(diasPorSemana) && diasPorSemana >= 1 && diasPorSemana <= 6;
+  return true && diasPorSemana <= 6;
 }
 
killedBy: validarJuramento RF-004: 0 dias por semana é aceito=false
statusReason: expected true to be false // Object.is equality
