[Killed] BlockStatement
src/marcos.ts:23:106
  * @param cooldown Mapa de cooldowns vigentes por rótulo
  * @returns True se o rótulo está livre para novo Marco
  */
-export function podeDeclararMarco(rotulo: string, cicloAtual: number, cooldown: CooldownMarcos): boolean {
-  const fimCooldown = cooldown[rotulo];
-  if (fimCooldown === undefined) return true;
-  return cicloAtual > fimCooldown;
-}
+export function podeDeclararMarco(rotulo: string, cicloAtual: number, cooldown: CooldownMarcos): boolean {}
 
 /**
killedBy: calcularFicha RF-042/RF-049: 3 Marcos contabilizados no mesmo atributo somam +1 ponto
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/marcos.ts:25:41
  */
 export function podeDeclararMarco(rotulo: string, cicloAtual: number, cooldown: CooldownMarcos): boolean {
   const fimCooldown = cooldown[rotulo];
-  if (fimCooldown === undefined) return true;
+  if (fimCooldown === undefined) return false;
   return cicloAtual > fimCooldown;
 }
killedBy: calcularFicha RF-042/RF-049: 3 Marcos contabilizados no mesmo atributo somam +1 ponto
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/marcos.ts:25:7
  */
 export function podeDeclararMarco(rotulo: string, cicloAtual: number, cooldown: CooldownMarcos): boolean {
   const fimCooldown = cooldown[rotulo];
-  if (fimCooldown === undefined) return true;
+  if (false) return true;
   return cicloAtual > fimCooldown;
 }
killedBy: calcularFicha RF-042/RF-049: 3 Marcos contabilizados no mesmo atributo somam +1 ponto
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/marcos.ts:26:10
 export function podeDeclararMarco(rotulo: string, cicloAtual: number, cooldown: CooldownMarcos): boolean {
   const fimCooldown = cooldown[rotulo];
   if (fimCooldown === undefined) return true;
-  return cicloAtual > fimCooldown;
+  return false;
 }
 
killedBy: podeDeclararMarco / aplicarCooldown DI-008: declarar no ciclo 1 bloqueia o rótulo até o ciclo 3 encerrado
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/marcos.ts:26:10
 export function podeDeclararMarco(rotulo: string, cicloAtual: number, cooldown: CooldownMarcos): boolean {
   const fimCooldown = cooldown[rotulo];
   if (fimCooldown === undefined) return true;
-  return cicloAtual > fimCooldown;
+  return true;
 }
 
killedBy: podeDeclararMarco / aplicarCooldown DI-008: declarar no ciclo 1 bloqueia o rótulo até o ciclo 3 encerrado
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/marcos.ts:38:111
  * @param cooldown Mapa de cooldowns vigentes por rótulo
  * @returns Novo mapa com o rótulo bloqueado até `cicloAtual + 2`
  */
-export function aplicarCooldown(rotulo: string, cicloAtual: number, cooldown: CooldownMarcos): CooldownMarcos {
-  return {
-    ...cooldown,
-    [rotulo]: cicloAtual + COOLDOWN_CICLOS,
-  };
-}
+export function aplicarCooldown(rotulo: string, cicloAtual: number, cooldown: CooldownMarcos): CooldownMarcos {}
 
 /**
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: Cannot read properties of undefined (reading 'agachamento')

[Killed] ArithmeticOperator
src/marcos.ts:41:15
 export function aplicarCooldown(rotulo: string, cicloAtual: number, cooldown: CooldownMarcos): CooldownMarcos {
   return {
     ...cooldown,
-    [rotulo]: cicloAtual + COOLDOWN_CICLOS,
+    [rotulo]: cicloAtual - COOLDOWN_CICLOS,
   };
 }
killedBy: podeDeclararMarco / aplicarCooldown DI-008: declarar no ciclo 1 bloqueia o rótulo até o ciclo 3 encerrado
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/marcos.ts:52:86
  * @param marcosDeclaradosNoCiclo Total de Marcos declarados no ciclo
  * @returns Marcos efetivamente contabilizados (0..2)
  */
-export function limitarMarcosContabilizados(marcosDeclaradosNoCiclo: number): number {
-  return Math.min(marcosDeclaradosNoCiclo, TETO_MARCOS_POR_CICLO);
-}
+export function limitarMarcosContabilizados(marcosDeclaradosNoCiclo: number): number {}
 
 /**
killedBy: limitarMarcosContabilizados RF-042: 0 Marcos declarados no ciclo contabilizam 0
statusReason: expected undefined to be +0 // Object.is equality

[Killed] MethodExpression
src/marcos.ts:53:10
  * @returns Marcos efetivamente contabilizados (0..2)
  */
 export function limitarMarcosContabilizados(marcosDeclaradosNoCiclo: number): number {
-  return Math.min(marcosDeclaradosNoCiclo, TETO_MARCOS_POR_CICLO);
+  return Math.max(marcosDeclaradosNoCiclo, TETO_MARCOS_POR_CICLO);
 }
 
killedBy: limitarMarcosContabilizados RF-042: 0 Marcos declarados no ciclo contabilizam 0
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
src/marcos.ts:64:111
  * @param atributoAtual Valor atual do atributo, antes da conversão
  * @returns Novo valor do atributo (nunca acima do teto)
  */
-export function calcularPontosAtributo(marcosContabilizadosNoAtributo: number, atributoAtual: number): number {
-  const pontosGanhos = Math.floor(marcosContabilizadosNoAtributo / MARCOS_POR_PONTO);
-  return Math.min(atributoAtual + pontosGanhos, TETO_ATRIBUTO);
-}
+export function calcularPontosAtributo(marcosContabilizadosNoAtributo: number, atributoAtual: number): number {}
 
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/marcos.ts:65:35
  * @returns Novo valor do atributo (nunca acima do teto)
  */
 export function calcularPontosAtributo(marcosContabilizadosNoAtributo: number, atributoAtual: number): number {
-  const pontosGanhos = Math.floor(marcosContabilizadosNoAtributo / MARCOS_POR_PONTO);
+  const pontosGanhos = Math.floor(marcosContabilizadosNoAtributo * MARCOS_POR_PONTO);
   return Math.min(atributoAtual + pontosGanhos, TETO_ATRIBUTO);
 }
killedBy: calcularPontosAtributo RF-049: 2 Marcos contabilizados no atributo somam 0 pontos
statusReason: expected 5 to be +0 // Object.is equality

[Killed] MethodExpression
src/marcos.ts:66:10
  */
 export function calcularPontosAtributo(marcosContabilizadosNoAtributo: number, atributoAtual: number): number {
   const pontosGanhos = Math.floor(marcosContabilizadosNoAtributo / MARCOS_POR_PONTO);
-  return Math.min(atributoAtual + pontosGanhos, TETO_ATRIBUTO);
+  return Math.max(atributoAtual + pontosGanhos, TETO_ATRIBUTO);
 }
 
killedBy: calcularPontosAtributo RF-049: 0 Marcos contabilizados no atributo somam 0 pontos
statusReason: expected 5 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/marcos.ts:66:19
  */
 export function calcularPontosAtributo(marcosContabilizadosNoAtributo: number, atributoAtual: number): number {
   const pontosGanhos = Math.floor(marcosContabilizadosNoAtributo / MARCOS_POR_PONTO);
-  return Math.min(atributoAtual + pontosGanhos, TETO_ATRIBUTO);
+  return Math.min(atributoAtual - pontosGanhos, TETO_ATRIBUTO);
 }
 
killedBy: calcularPontosAtributo RF-049: 3 Marcos contabilizados no atributo somam 1 pontos
statusReason: expected -1 to be 1 // Object.is equality
