[Killed] BlockStatement
src/vontade.ts:16:66
  * @param ciclosCumpridos Quantidade de ciclos com Juramento cumprido
  * @returns Modificador de Vontade (0..3)
  */
-export function calcularVontade(ciclosCumpridos: number): number {
-  if (ciclosCumpridos >= 14) return 3;
-  if (ciclosCumpridos >= 6) return 2;
-  if (ciclosCumpridos >= 2) return 1;
-  return 0;
-}
+export function calcularVontade(ciclosCumpridos: number): number {}
 
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
src/vontade.ts:17:7
  * @returns Modificador de Vontade (0..3)
  */
 export function calcularVontade(ciclosCumpridos: number): number {
-  if (ciclosCumpridos >= 14) return 3;
+  if (false) return 3;
   if (ciclosCumpridos >= 6) return 2;
   if (ciclosCumpridos >= 2) return 1;
killedBy: calcularVontade PRD §4.4: 14 ciclos cumpridos resulta em Vontade 3
statusReason: expected 2 to be 3 // Object.is equality

[Killed] EqualityOperator
src/vontade.ts:17:7
  * @returns Modificador de Vontade (0..3)
  */
 export function calcularVontade(ciclosCumpridos: number): number {
-  if (ciclosCumpridos >= 14) return 3;
+  if (ciclosCumpridos < 14) return 3;
   if (ciclosCumpridos >= 6) return 2;
   if (ciclosCumpridos >= 2) return 1;
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected 3 to be 1 // Object.is equality

[Killed] EqualityOperator
src/vontade.ts:18:7
  */
 export function calcularVontade(ciclosCumpridos: number): number {
   if (ciclosCumpridos >= 14) return 3;
-  if (ciclosCumpridos >= 6) return 2;
+  if (ciclosCumpridos > 6) return 2;
   if (ciclosCumpridos >= 2) return 1;
   return 0;
killedBy: calcularVontade PRD §4.4: 6 ciclos cumpridos resulta em Vontade 2
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/vontade.ts:18:7
  */
 export function calcularVontade(ciclosCumpridos: number): number {
   if (ciclosCumpridos >= 14) return 3;
-  if (ciclosCumpridos >= 6) return 2;
+  if (true) return 2;
   if (ciclosCumpridos >= 2) return 1;
   return 0;
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected 2 to be 1 // Object.is equality

[Killed] EqualityOperator
src/vontade.ts:19:7
 export function calcularVontade(ciclosCumpridos: number): number {
   if (ciclosCumpridos >= 14) return 3;
   if (ciclosCumpridos >= 6) return 2;
-  if (ciclosCumpridos >= 2) return 1;
+  if (ciclosCumpridos > 2) return 1;
   return 0;
 }
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/vontade.ts:19:7
 export function calcularVontade(ciclosCumpridos: number): number {
   if (ciclosCumpridos >= 14) return 3;
   if (ciclosCumpridos >= 6) return 2;
-  if (ciclosCumpridos >= 2) return 1;
+  if (ciclosCumpridos < 2) return 1;
   return 0;
 }
killedBy: calcularFicha ADR-0002: replay de dois ciclos projeta ficha final consistente
statusReason: expected +0 to be 1 // Object.is equality
